[
  {
    "name": "Marty DiMarzio",
    "email": "mdimarzio@deloitte.com",
    "title": "Global Account Leader & Board Member| Life Sciences",
    "telephone": "+1 617 437 3730",
    "linkedIn": "https://www.linkedin.com/pub/marty-dimarzio/0/287/11b",
    "description": "Marty is a leader in Deloitte Consulting LLP, with a track record of architecting and delivering complex global transformations for some of our largest life sciences clients. He serves as the Global Lead Client Service Partner for a Fortune 500 client.",
    "long_description": "Marty is a leader in Deloitte Consulting LLP, with a track record of architecting and delivering complex global transformations for some of our largest life sciences clients. He serves as the Global Lead Client Service Partner for a Fortune 500 client. Marty has spent his entire career with Deloitte, working closely with Fortune 500 clients on a range of strategy, business transformation, acquisition and divestiture, and systems implementation projects. He is well known for developing strong relationships across Deloitte’s network globally to provide a full breadth of capabilities and delivery to clients. In addition to his leadership serving clients globally, Marty serves as the Yale School of Management Lead Recruiting Principal. Previous management roles include serving as the US Industry Leader for Human Capital, as well as serving as a member of the Life Sciences Healthcare Industry Executive Committee and the Human Capital Offering Executive Committee. He is also a champion of Deloitte Greenhouse client experiences. Marty is a member of the US Deloitte Board of Directors and has held various governance roles, including as a member of the US Deloitte Board Council and US Deloitte Nominating Committee, and as co-chair of the US Consulting Peering Committee. Marty received his bachelor’s degree from Cornell University and his MBA from Yale School of Management.",
    "address": "115 Federal Street, Winthrop Center Floors 12,13,14,15 Boston MA United States 02110-1894",
    "image_url": "https://www2.deloitte.com/content/dam/Deloitte/us/Images/promo_images/profile-pictures/m-s/marty-dimario.jpg"
  },
  {
    "name": "Matt David",
    "email": "mdavid@deloitte.com",
    "title": "Partner, Principal, and Managing Director Talent Leader",
    "telephone": "+1 404 631 2068",
    "linkedIn": "https://www.linkedin.com/in/matt-david-a2245b",
    "description": "Matt is a principal at Deloitte Consulting LLP and serves as internal Partner, Principal, and Managing Director Talent Leader. In this role, he leads the organization’s talent strategy and coaching for the organization’s executive talent. Matt previously led the organization’s talent experience work",
    "long_description": "Matt is a principal at Deloitte Consulting LLP and serves as internal Partner, Principal, and Managing Director Talent Leader. In this role, he leads the organization’s talent strategy and coaching for the organization’s executive talent. Matt previously led the organization’s talent experience work as Chief Talent Officer. Matt joined Deloitte in 1996 and has more than 25 years of consulting experience, which included multiple large and strategic merger integrations, service delivery model design, customer strategy, and operational transformation engagements in the banking, brokerage, and asset management industries. From leading the organization’s Strategy & Analytics practice to serving as the Lead Client Service Principal for a major financial institution, Matt has always been a champion for his teams and maintained a strong focus on coaching and developing talent. Matt received a BS in Finance from Boston University in 1989 and MBA from the University of North Carolina’s Kenan-Flagler Business School in 1996. He is based in Charlotte.",
    "address": "1230 Peachtree Street, NE Suite 3100 Atlanta   GA United States 30309",
    "image_url": "https://www2.deloitte.com/content/dam/Deloitte/us/Images/promo_images/profile-pictures/m-s/matt-david-new.jpg"
  },
  {
    "name": "So Chan",
    "email": "sochan1@deloitte.com",
    "title": "National Enterprise Performance Offering Portfolio Leader | Deloitte Consulting LLP",
    "telephone": "+1 949 400 8869",
    "linkedIn": "https://www.linkedin.com/in/hannahsochan",
    "description": "So Chan is a principal, leading Deloitte’s US Enterprise Performance (EP) Offering Portfolio. This portfolio provides Advise, Implement and Operate services for a variety of enterprise functions across industries. From end-to-end enterprise transformations bringing together business and IT, to digit",
    "long_description": "So Chan is a principal, leading Deloitte’s US Enterprise Performance (EP) Offering Portfolio. This portfolio provides Advise, Implement and Operate services for a variety of enterprise functions across industries. From end-to-end enterprise transformations bringing together business and IT, to digital supply chain optimization, manufacturing and product strategies, procurement as-a-service, planning and fulfillment, ITSM, and full-scale application managed services and BPO. This portfolio offers competency in many ERP platforms such as SAP, Oracle, Workday Financials, Microsoft Dynamics, and Infor, in addition to ServiceNow, Ariba and Coupa. So has more than 25 years of experience advising life sciences clients on large, global ERP and digital transformation initiatives. So has served in a variety of account leadership roles during her tenure at Deloitte and is recognized for her ability to collaboratively craft innovative solutions that align with both market trends and organizational goals, ensuring sustainable growth and competitive advantage for clients.",
    "address": "695 Town Center Dr. Suite 1000 Costa Mesa CA United States 92626",
    "image_url": "https://www2.deloitte.com/content/dam/Deloitte/us/Images/promo_images/profile-pictures/m-s/so-chan.jpg"
  },
  {
    "name": "Prakul Sharma",
    "email": "praksharma@deloitte.com",
    "title": " AI & Insights Practice Leader",
    "telephone": "+1 408 704 4831",
    "linkedIn": "https://www.linkedin.com/in/prakulsharma/",
    "description": "Prakul is a distinguished leader in Deloitte Consulting LLP's AI & Engineering practice, with over 18 years of expertise in delivering and managing cutting-edge Artificial Intelligence (AI), Cloud, Data Engineering and Data Operations solutions. In his role as the leader of Deloitte's AI & Insights",
    "long_description": "Prakul is a distinguished leader in Deloitte Consulting LLP&#39s AI & Engineering practice, with over 18 years of expertise in delivering and managing cutting-edge Artificial Intelligence (AI), Cloud, Data Engineering and Data Operations solutions. In his role as the leader of Deloitte&#39s AI & Insights Practice, Prakul oversees sustainable AI/ML initiatives, leveraging AI&#39s transformative power to revolutionize business operations. His leadership is marked by scaling AI solutions and deploying intelligent AI agents & Gen AI capabilities, enhancing decision-making and operational efficiency. In the past, Prakul has spearheaded numerous large-scale, global, and complex data, analytics and AI transformations, collaborating seamlessly with business, functional, and technology stakeholders driving strategic business outcomes for clients. His commitment to innovation is evident in his active involvement in research, analysis, and evaluation of emerging AI and Data capabilities. Prakul has authored numerous articles and whitepapers, offering fresh and practical insights into the evolving landscape of AI & Data. As a trusted advisor to senior management, including C-suite executives, Prakul excels in guiding AI-enabled strategic transformations. His extensive experience spans Fortune 500 clients across various industries, with a particular focus on Banking & Capital Markets.",
    "address": "225 West Santa Clara Street Suite 600 San Jose CA United States 95113-2303",
    "image_url": "https://www2.deloitte.com/content/dam/Deloitte/us/Images/promo_images/profile-pictures/m-s/us-prakul-sharma-700x700.jpg"
  },
  {
    "name": "James Cascone",
    "email": "cjcascone@deloitte.com",
    "title": "Partner | Deloitte Risk & Financial Advisory",
    "telephone": "+1 305 372 3229",
    "linkedIn": "https://www.linkedin.com/in/james-carlo-cascone-94b0782/",
    "description": "James Cascone leads Deloitte’s Sustainability strategic growth offering in the US for the consumer industry and serves on Deloitte’s Global Council for Sustainability Alliances & Technology, delivering strategic insights to clients on how technology can enable sustainable development. Additionally,",
    "long_description": "James Cascone leads Deloitte’s Sustainability strategic growth offering in the US for the consumer industry and serves on Deloitte’s Global Council for Sustainability Alliances & Technology, delivering strategic insights to clients on how technology can enable sustainable development. Additionally, James is the Deloitte Americas’ Future of Food Convergence leader spearheading a cross-industry program that is transforming the food ecosystem by enhancing transparency, advancing a circular economy, and engineering climate-smart products that prioritize human sustainability and a nature-positive system. With experience serving clients in over 85 countries and fluency in three languages, James brings a global perspective to his work. He is also an active board member of the United States Council for International Business (USCIB), and is a contributing member on their Climate Change Working Group, as well as their Environmental, and Corporate Responsibility and Labor Affairs Committees.",
    "address": "",
    "image_url": "https://www2.deloitte.com/content/dam/Deloitte/us/Images/promo_images/profile-pictures/james-Cascone-700x700.png"
  },
  {
    "name": "Andrew Douglas",
    "email": "andouglas@deloitte.com",
    "title": "Cyber Defense & Resilience, Managing Director | Deloitte Risk & Financial Advisory",
    "telephone": "+1 415 783 4062",
    "linkedIn": "https://www.linkedin.com/in/andrewwdouglas",
    "description": "Andrew, a managing director at Deloitte & Touche LLP, is the US’s Attack Surface Management leader within the Cyber & Strategic Risk Practice, where he focuses on helping our clients know, assess, and reduce their attack surface across all technology layers, including building defensive and offensiv",
    "long_description": "Andrew, a managing director at Deloitte & Touche LLP, is the US’s Attack Surface Management leader within the Cyber & Strategic Risk Practice, where he focuses on helping our clients know, assess, and reduce their attack surface across all technology layers, including building defensive and offensive security programs. He leads large scale engagements to design, build, and operate these programs, with an emphasis on cloud enablement. As part of our Cyber infrastructure team, he also leads large scale cyber infrastructure enhancements engagements, focused on improving and automating network security. He has more than 20 years of experience with Deloitte performing consultative cyber security services for our clients globally. This has included significant work leading large scale cyber internal audit, red teaming, cloud assessment, penetration testing, and vulnerability assessments for clients in the financial services sector, technology, life sciences and health care and other industries, as well as wider cyber security strategy, program, and capabilities assessments.",
    "address": "95 S. State Street Suite 900 Salt Lake City UT United States 84111",
    "image_url": "https://www2.deloitte.com/content/dam/Deloitte/us/Images/promo_images/profile-pictures/us-andrew-douglas.jpeg"
  },
  {
    "name": "Chris Ruggeri",
    "email": "cruggeri@deloitte.com",
    "title": "Principal | Risk & Financial Advisory | Deloitte Transactions and Business Analytics LLP",
    "telephone": "+1 212 436 4626",
    "linkedIn": "https://www.linkedin.com/in/chris-ruggeri-a2709292",
    "description": "Chris Ruggeri is Deloitte Risk & Financial Advisory’s Sustainability leader. She advises clients across industries with a focus on leveraging digital tools and analytics to help them enhance investment decisions and risk management. With more than 30 years of experience, Chris works closely with lea",
    "long_description": "Chris Ruggeri is Deloitte Risk & Financial Advisory’s Sustainability leader. She advises clients across industries with a focus on leveraging digital tools and analytics to help them enhance investment decisions and risk management. With more than 30 years of experience, Chris works closely with leaders across a wide range of industries and disciplines to help them effectively develop and implement sustainability-based approaches drawing on innovative thinking, technologies, and collaborations. She helps our clients manage strategic risk to drive sustainable shareholder value, financial flexibility, and agility, while improving stakeholder confidence in a constantly changing world. Additionally, Chris leads Investor Relations (IR) for Deloitte’s CFO Program and has been quoted by top-tier media on sustainability, IR, Mergers & Acquisitions (M&A), and corporate development. Chris has extensive M&A experience and has served as the M&A leader where she advised companies, boards of directors, and special committees on negotiated and unsolicited transactions. Prior to joining Deloitte, she was a Managing Director at Standard & Poor’s, a Principal in the Financial Advisory Services practice of a Big-4 firm and started her career as an associate at the NASD (now FINRA). Chris is the board chair of Citizens Committee for New York City . Their mission focuses on New York City neighborhoods that lack access to opportunity, they strive to help New Yorkers come together and improve the quality of life for all.",
    "address": "30 Rockefeller Plaza 41st Floor  New York NY United States 10112-0015",
    "image_url": "https://www2.deloitte.com/content/dam/Deloitte/us/Images/promo_images/profile-pictures/chris-ruggeri-headshot.png"
  },
  {
    "name": "Ed Hardy",
    "email": "ehardy@deloitte.com",
    "title": "Partner | Deloitte & Touche LLP",
    "telephone": "+1 212 436 2832",
    "linkedIn": "https://www.linkedin.com/in/edjhardy/",
    "description": "Ed leads the integrated Finance Transformation practice across Deloitte’s Audit and Assurance, Consulting, Risk and Financial Advisory, and Tax businesses. In this role, he is responsible for the integration and innovation of Deloitte’s services to help clients modernize Finance into a dynamic drive",
    "long_description": "Ed leads the integrated Finance Transformation practice across Deloitte’s Audit and Assurance, Consulting, Risk and Financial Advisory, and Tax businesses. In this role, he is responsible for the integration and innovation of Deloitte’s services to help clients modernize Finance into a dynamic driver of real-time insight and foresight, enabling the entire enterprise to evolve faster. Ed has served some of Deloitte’s largest relationship and attest accounts and held various executive and management committee roles over the past 30 years. Most recently, he was the global lead client services partner on a Fortune 50 company, and he currently serves as an Advisory partner to several financial services companies. Ed is also one of Deloitte’s leading subject matter specialists with respect to complex financial instruments and valuation, serving both attest and consulting clients. Ed received his Bachelor of Arts from Moravian University. He is a Certified Public Accountant in New York and New Jersey and is a member of the American Institute of Certified Public Accountants.",
    "address": "",
    "image_url": "https://www2.deloitte.com/content/dam/Deloitte/us/Images/promo_images/profile-pictures/a-e/us-ed-hardy.jpg"
  },
  {
    "name": "Brian Jobe",
    "email": "bjobe@deloitte.com",
    "title": "Partner | Risk and Financial Advisory",
    "telephone": "+1 908 419 5355",
    "linkedIn": "https://www.linkedin.com/in/brianjobe-deloitte",
    "description": "Brian Jobe is a Partner in Risk and Financial Advisory for Deloitte & Touche LLP. He has over 25 years experience assisting complex global organizations undertake transformative activities. Brian is the US leader for Carbon Accounting, is the Finance and Controllership lead for the Sustainability of",
    "long_description": "Brian Jobe is a Partner in Risk and Financial Advisory for Deloitte & Touche LLP. He has over 25 years experience assisting complex global organizations undertake transformative activities. Brian is the US leader for Carbon Accounting, is the Finance and Controllership lead for the Sustainability offerings for Life Sciences clients and is the US lead for our SAP Sustainability offerings. In these roles, Brian is focused on supporting clients on their journey to implementing and operationalizing processes and technology to address the regulatory and market-based pressures related to sustainability.",
    "address": "110 Morris Street Morristown NJ United States 07960",
    "image_url": "https://www2.deloitte.com/content/dam/Deloitte/us/Images/promo_images/profile-pictures/f-l/us-brian-jobe-700x700.jpg"
  },
  {
    "name": "Susan Goldsmith",
    "email": "sugoldsmith@deloitte.com",
    "title": "Sustainability Leader | Deloitte US",
    "telephone": "+1 213 688 4170",
    "linkedIn": "https://www.linkedin.com/pub/susan-goldsmith/38/334/25b",
    "description": "Susan Goldsmith is a seasoned executive with over 25 years of experience in Media and Entertainment, Consumer Products / Retail, and High Tech, specializing all aspects of broad scale organizational strategy and change. Susan leads Deloitte’s relationship with several Fortune 500 companies to enable",
    "long_description": "Susan Goldsmith is a seasoned executive with over 25 years of experience in Media and Entertainment, Consumer Products / Retail, and High Tech, specializing all aspects of broad scale organizational strategy and change. Susan leads Deloitte’s relationship with several Fortune 500 companies to enable growth through global branding capabilities, customer engagement / experience and digital enablement. Susan has focused her career on working with executives who are leading a broad change agenda, helping them translate their aspirations into an executable program. She brings vast experience across people, process, and technology and has herself been the executive on several multi-year, enterprise-wide transformations. She specializes in the oftentimes more difficult dynamics of change including leadership, talent and culture. Susan is also Deloitte’s US Sustainability Leader in Growth & Purpose. In this role, Susan builds on her longstanding commitment to social impact to guide the internal strategy and execution of the US climate ambitions in collaboration with the Deloitte Global network. She will work closely with the Social Impact team and collaborate closely with Deloitte’s external Sustainability Strategic Growth Offering (SGO), who bring innovative solutions and capabilities to our clients to support their sustainability aspirations. Susan has a dual Masters degree from the University of Pennsylvania in Social Psychology and Education, with a concentration in Organizational Behavior from the Wharton School of Business. Through this focus on education and workforce development, Susan commits her time to the Boards of both the Posse Foundation and the Cayton Children’s Museum. She lives in Los Angeles with her husband and two children.",
    "address": "555 West 5th Street Suite 2700 Los Angeles CA United States 90013-1010",
    "image_url": "https://www2.deloitte.com/content/dam/Deloitte/us/Images/promo_images/profile-pictures/m-s/susan-goldsmith.png"
  }
]
